In [ ]:
1.Find out how many male and female passenger was onboarded
2.How many survived we have
3.How many casuality we have
4.what is the name of the person who is the eldest one.
5.How many passanger do we have in first,second and third class.
6.How many person do we have whose name starts with "s".
7.Try to create a column which is a summation of "Sibsp" and "parch".
8.How many person do we have age below age 25.
9.How many person died whose age was less than 40.
10.From a cabin column seperate text and numeric value.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### 1.Find out how many male and female passenger was onboarded

In [5]:
len(df[df["Sex"] == "male"])

577

In [6]:
len(df[df["Sex"] == "female"])

314

### 2.How many survived we have

In [7]:
len(df[df["Survived"]==1])

342

### 3.How many casuality we have

In [8]:
len(df[df["Survived"]==0])

549

### 4.what is the name of the person who is the eldest one.

In [12]:
df[df["Age"] == max(df["Age"])]["Name"]

630    Barkworth, Mr. Algernon Henry Wilson
Name: Name, dtype: object

### 5.How many passanger do we have in first,second and third class.

In [13]:
len(df[df["Pclass"]==1])

216

In [14]:
len(df[df["Pclass"]==2])

184

In [15]:
len(df[df["Pclass"]==3])

491

### 6.How many person do we have whose name starts with "s".

In [19]:
len(df[df["Name"].str[0] == "S"])

86

### 7.Try to create a column which is a summation of "Sibsp" and "parch".

In [22]:
df["Sum of SibSp and Parch"] = df["SibSp"]+df["Parch"]

In [23]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sum of SibSp and Parch
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

### 8.How many person do we have age below age 25.

In [24]:
len(df[df["Age"]<25])

278

### 9.How many person died whose age was less than 40.

In [38]:
df2 = df[df["Age"]<40]

In [39]:
len(df2[df2["Survived"]==0])

322

### 10.From a cabin column seperate text and numeric value.

In [45]:
df2 = df["Cabin"].dropna(axis=0)

In [51]:
df2.str[0]

1      C
3      C
6      E
10     G
11     C
      ..
871    D
872    B
879    C
887    B
889    C
Name: Cabin, Length: 204, dtype: object

In [52]:
df2.str[1:]

1              85
3             123
6              46
10              6
11            103
          ...
871            35
872    51 B53 B55
879            50
887            42
889           148
Name: Cabin, Length: 204, dtype: object